garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1773.PIC
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xF"/>
        <edc:SFRDef edc:access="----n---" edc:cname="PORTE" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----u---" edc:name="PORTE" edc:nzwidth="8" edc:por="----x---" edc:_addr="0x10">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR1" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x11">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IF" edc:desc="TMR1 Overflow Interrupt Flag bit" edc:mask="0x1" edc:name="TMR1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IF" edc:desc="TMR2 to PR2 Match Interrupt Flag bit" edc:mask="0x1" edc:name="TMR2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IF" edc:desc="" edc:mask="0x1" edc:name="CCP1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1IF" edc:desc="Synchronous Serial Port (MSSP) Interrupt Flag bit" edc:mask="0x1" edc:name="SSP1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXIF" edc:desc="EUSART Transmit Interrupt Enable bit" edc:mask="0x1" edc:name="TXIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCIF" edc:desc="EUSART Receive Interrupt Enable bit" edc:mask="0x1" edc:name="RCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADIF" edc:desc="A/D Converter Interrupt Flag bit" edc:mask="0x1" edc:name="ADIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIF" edc:desc="Timer1 Gate Interrupt Flag bit" edc:mask="0x1" edc:name="TMR1GIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CCPIF" edc:desc="" edc:mask="0x1" edc:name="CCPIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR2" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x12">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2IF" edc:desc="" edc:mask="0x1" edc:name="CCP2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3IF" edc:desc="" edc:mask="0x1" edc:name="C3IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4IF" edc:desc="Numerically Controlled Oscillator Flag bit" edc:mask="0x1" edc:name="C4IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCL1IF" edc:desc="MSSP Bus Collision Interrupt Flag bit" edc:mask="0x1" edc:name="BCL1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COG1IF" edc:mask="0x1" edc:name="COG1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1IF" edc:desc="Numerically Controlled Oscillator Flag bit" edc:mask="0x1" edc:name="C1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2IF" edc:desc="Numerically Controlled Oscillator Flag bit" edc:mask="0x1" edc:name="C2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OSFIF" edc:desc="Oscillator Fail Interrupt Enable bit" edc:mask="0x1" edc:name="OSFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PIR3" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PIR3" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x13">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLC1IF" edc:desc="Configurable Logic Block Interrupt Flag" edc:mask="0x1" edc:name="CLC1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC2IF" edc:desc="Configurable Logic Block Interrupt Flag" edc:mask="0x1" edc:name="CLC2IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IF" edc:desc="Configurable Logic Block Interrupt Flag" edc:mask="0x1" edc:name="CLC3IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC4IF" edc:desc="" edc:mask="0x1" edc:name="CLC4IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZCDIF" edc:desc="" edc:mask="0x1" edc:name="ZCDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COG2IF" edc:desc="" edc:mask="0x1" edc:name="COG2IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PIR4" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="PIR4" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x14">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4IF" edc:desc="" edc:mask="0x1" edc:name="TMR4IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6IF" edc:desc="" edc:mask="0x1" edc:name="TMR6IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3IF" edc:desc="" edc:mask="0x1" edc:name="TMR3IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIF" edc:desc="" edc:mask="0x1" edc:name="TMR3GIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5IF" edc:desc="" edc:mask="0x1" edc:name="TMR5IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIF" edc:desc="" edc:mask="0x1" edc:name="TMR5GIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR8IF" edc:mask="0x1" edc:name="TMR8IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
