garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1773.PIC
        <edc:SFRDef edc:access="nnrn----" edc:cname="PWM9CON" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000----" edc:name="PWM9CON" edc:nzwidth="8" edc:por="0000----" edc:_modsrc="DOS-02719_pwm_10bit_v3_8Bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x61C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="PWM9POL" edc:desc="" edc:mask="0x1" edc:name="PWM9POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM9OUT" edc:desc="" edc:mask="0x1" edc:name="PWM9OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM9OE" edc:desc="" edc:mask="0x1" edc:name="PWM9OE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM9EN" edc:desc="" edc:mask="0x1" edc:name="PWM9EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x61D"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="13" edc:beginaddr="0x680" edc:endaddr="0x6A0" edc:regionid="sfr13">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x680"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x68C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1PHR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1PHR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x68D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x3f" edc:name="PHR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHR0" edc:desc="" edc:mask="0x1" edc:name="PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR1" edc:desc="" edc:mask="0x1" edc:name="PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR2" edc:desc="" edc:mask="0x1" edc:name="PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR3" edc:desc="" edc:mask="0x1" edc:name="PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR4" edc:desc="" edc:mask="0x1" edc:name="PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHR5" edc:desc="" edc:mask="0x1" edc:name="PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1PHR0" edc:desc="" edc:mask="0x1" edc:name="G1PHR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR1" edc:desc="" edc:mask="0x1" edc:name="G1PHR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR2" edc:desc="" edc:mask="0x1" edc:name="G1PHR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR3" edc:desc="" edc:mask="0x1" edc:name="G1PHR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR4" edc:desc="" edc:mask="0x1" edc:name="G1PHR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHR5" edc:desc="" edc:mask="0x1" edc:name="G1PHR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1PHF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1PHF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x68E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x3f" edc:name="PHF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PHF0" edc:desc="" edc:mask="0x1" edc:name="PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF1" edc:desc="" edc:mask="0x1" edc:name="PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF2" edc:desc="" edc:mask="0x1" edc:name="PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF3" edc:desc="" edc:mask="0x1" edc:name="PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF4" edc:desc="" edc:mask="0x1" edc:name="PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHF5" edc:desc="" edc:mask="0x1" edc:name="PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1PHF0" edc:desc="" edc:mask="0x1" edc:name="G1PHF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF1" edc:desc="" edc:mask="0x1" edc:name="G1PHF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF2" edc:desc="" edc:mask="0x1" edc:name="G1PHF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF3" edc:desc="" edc:mask="0x1" edc:name="G1PHF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF4" edc:desc="" edc:mask="0x1" edc:name="G1PHF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1PHF5" edc:desc="" edc:mask="0x1" edc:name="G1PHF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1BLKR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1BLKR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x68F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKR" edc:desc="" edc:mask="0x3f" edc:name="BLKR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKR0" edc:desc="" edc:mask="0x1" edc:name="BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR1" edc:desc="" edc:mask="0x1" edc:name="BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR2" edc:desc="" edc:mask="0x1" edc:name="BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR3" edc:desc="" edc:mask="0x1" edc:name="BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR4" edc:desc="" edc:mask="0x1" edc:name="BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKR5" edc:desc="" edc:mask="0x1" edc:name="BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1BLKR0" edc:desc="" edc:mask="0x1" edc:name="G1BLKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR1" edc:desc="" edc:mask="0x1" edc:name="G1BLKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR2" edc:desc="" edc:mask="0x1" edc:name="G1BLKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR3" edc:desc="" edc:mask="0x1" edc:name="G1BLKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR4" edc:desc="" edc:mask="0x1" edc:name="G1BLKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKR5" edc:desc="" edc:mask="0x1" edc:name="G1BLKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1BLKF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1BLKF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x690">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BLKF" edc:desc="" edc:mask="0x3f" edc:name="BLKF" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="BLKF0" edc:desc="" edc:mask="0x1" edc:name="BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF1" edc:desc="" edc:mask="0x1" edc:name="BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF2" edc:desc="" edc:mask="0x1" edc:name="BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF3" edc:desc="" edc:mask="0x1" edc:name="BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF4" edc:desc="" edc:mask="0x1" edc:name="BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BLKF5" edc:desc="" edc:mask="0x1" edc:name="BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1BLKF0" edc:desc="" edc:mask="0x1" edc:name="G1BLKF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF1" edc:desc="" edc:mask="0x1" edc:name="G1BLKF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF2" edc:desc="" edc:mask="0x1" edc:name="G1BLKF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF3" edc:desc="" edc:mask="0x1" edc:name="G1BLKF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF4" edc:desc="" edc:mask="0x1" edc:name="G1BLKF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1BLKF5" edc:desc="" edc:mask="0x1" edc:name="G1BLKF5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1DBR" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1DBR" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x691">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBR" edc:desc="" edc:mask="0x3f" edc:name="DBR" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="DBR0" edc:desc="" edc:mask="0x1" edc:name="DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR1" edc:desc="" edc:mask="0x1" edc:name="DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR2" edc:desc="" edc:mask="0x1" edc:name="DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR3" edc:desc="" edc:mask="0x1" edc:name="DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR4" edc:desc="" edc:mask="0x1" edc:name="DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBR5" edc:desc="" edc:mask="0x1" edc:name="DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBR0" edc:desc="" edc:mask="0x1" edc:name="G1DBR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR1" edc:desc="" edc:mask="0x1" edc:name="G1DBR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR2" edc:desc="" edc:mask="0x1" edc:name="G1DBR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR3" edc:desc="" edc:mask="0x1" edc:name="G1DBR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR4" edc:desc="" edc:mask="0x1" edc:name="G1DBR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBR5" edc:desc="" edc:mask="0x1" edc:name="G1DBR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="COG1DBF" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="COG1DBF" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x692">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBF0" edc:desc="" edc:mask="0x1" edc:name="DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF1" edc:desc="" edc:mask="0x1" edc:name="DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF2" edc:desc="" edc:mask="0x1" edc:name="DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF3" edc:desc="" edc:mask="0x1" edc:name="DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF4" edc:desc="" edc:mask="0x1" edc:name="DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBF5" edc:desc="" edc:mask="0x1" edc:name="DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G1DBF0" edc:desc="" edc:mask="0x1" edc:name="G1DBF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF1" edc:desc="" edc:mask="0x1" edc:name="G1DBF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF2" edc:desc="" edc:mask="0x1" edc:name="G1DBF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF3" edc:desc="" edc:mask="0x1" edc:name="G1DBF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF4" edc:desc="" edc:mask="0x1" edc:name="G1DBF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1DBF5" edc:desc="" edc:mask="0x1" edc:name="G1DBF5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1DBF" edc:desc="" edc:mask="0x3f" edc:name="G1DBF" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="COG1CON0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-00000" edc:name="COG1CON0" edc:nzwidth="0x8" edc:por="00-00000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x693">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD" edc:desc="" edc:mask="0x7" edc:name="MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LD" edc:desc="" edc:mask="0x1" edc:name="LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MD0" edc:desc="" edc:mask="0x1" edc:name="MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD1" edc:desc="" edc:mask="0x1" edc:name="MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MD2" edc:desc="" edc:mask="0x1" edc:name="MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1MD" edc:desc="" edc:mask="0x7" edc:name="G1MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="G1CS" edc:desc="" edc:mask="0x3" edc:name="G1CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G1LD" edc:desc="" edc:mask="0x1" edc:name="G1LD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1EN" edc:desc="" edc:mask="0x1" edc:name="G1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="G1MD0" edc:desc="" edc:mask="0x1" edc:name="G1MD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1MD1" edc:desc="" edc:mask="0x1" edc:name="G1MD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1MD2" edc:desc="" edc:mask="0x1" edc:name="G1MD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1CS0" edc:desc="" edc:mask="0x1" edc:name="G1CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1CS1" edc:desc="" edc:mask="0x1" edc:name="G1CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn--nnnn" edc:cname="COG1CON1" edc:desc="" edc:impl="0xcf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000" edc:name="COG1CON1" edc:nzwidth="8" edc:por="00--0000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x694">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FDBS" edc:desc="" edc:mask="0x1" edc:name="FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RDBS" edc:desc="" edc:mask="0x1" edc:name="RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1POLA" edc:desc="" edc:mask="0x1" edc:name="G1POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLB" edc:desc="" edc:mask="0x1" edc:name="G1POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLC" edc:desc="" edc:mask="0x1" edc:name="G1POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1POLD" edc:desc="" edc:mask="0x1" edc:name="G1POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G1FDBS" edc:desc="" edc:mask="0x1" edc:name="G1FDBS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RDBS" edc:desc="" edc:mask="0x1" edc:name="G1RDBS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x695">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS0" edc:desc="" edc:mask="0x1" edc:name="RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS1" edc:desc="" edc:mask="0x1" edc:name="RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS2" edc:desc="" edc:mask="0x1" edc:name="RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS3" edc:desc="" edc:mask="0x1" edc:name="RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS4" edc:desc="" edc:mask="0x1" edc:name="RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS5" edc:desc="" edc:mask="0x1" edc:name="RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS6" edc:desc="" edc:mask="0x1" edc:name="RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS7" edc:desc="" edc:mask="0x1" edc:name="RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RIS0" edc:desc="" edc:mask="0x1" edc:name="G1RIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS1" edc:desc="" edc:mask="0x1" edc:name="G1RIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS2" edc:desc="" edc:mask="0x1" edc:name="G1RIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS3" edc:desc="" edc:mask="0x1" edc:name="G1RIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS4" edc:desc="" edc:mask="0x1" edc:name="G1RIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS5" edc:desc="" edc:mask="0x1" edc:name="G1RIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS6" edc:desc="" edc:mask="0x1" edc:name="G1RIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS7" edc:desc="" edc:mask="0x1" edc:name="G1RIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG1RIS1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG1RIS1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x696">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RIS8" edc:desc="" edc:mask="0x1" edc:name="RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS9" edc:desc="" edc:mask="0x1" edc:name="RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS10" edc:desc="" edc:mask="0x1" edc:name="RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS11" edc:desc="" edc:mask="0x1" edc:name="RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS12" edc:desc="" edc:mask="0x1" edc:name="RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS13" edc:desc="" edc:mask="0x1" edc:name="RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS14" edc:desc="" edc:mask="0x1" edc:name="RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RIS15" edc:desc="" edc:mask="0x1" edc:name="RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1RIS8" edc:desc="" edc:mask="0x1" edc:name="G1RIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS9" edc:desc="" edc:mask="0x1" edc:name="G1RIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS10" edc:desc="" edc:mask="0x1" edc:name="G1RIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS11" edc:desc="" edc:mask="0x1" edc:name="G1RIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS12" edc:desc="" edc:mask="0x1" edc:name="G1RIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS13" edc:desc="" edc:mask="0x1" edc:name="G1RIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS14" edc:desc="" edc:mask="0x1" edc:name="G1RIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G1RIS15" edc:desc="" edc:mask="0x1" edc:name="G1RIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
