garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1773.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG3FIS0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG3FIS0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x819">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIS0" edc:desc="" edc:mask="0x1" edc:name="FIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS1" edc:desc="" edc:mask="0x1" edc:name="FIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS2" edc:desc="" edc:mask="0x1" edc:name="FIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS3" edc:desc="" edc:mask="0x1" edc:name="FIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS4" edc:desc="" edc:mask="0x1" edc:name="FIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS5" edc:desc="" edc:mask="0x1" edc:name="FIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS6" edc:desc="" edc:mask="0x1" edc:name="FIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS7" edc:desc="" edc:mask="0x1" edc:name="FIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3FIS0" edc:desc="" edc:mask="0x1" edc:name="G3FIS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS1" edc:desc="" edc:mask="0x1" edc:name="G3FIS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS2" edc:desc="" edc:mask="0x1" edc:name="G3FIS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS3" edc:desc="" edc:mask="0x1" edc:name="G3FIS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS4" edc:desc="" edc:mask="0x1" edc:name="G3FIS4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS5" edc:desc="" edc:mask="0x1" edc:name="G3FIS5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS6" edc:desc="" edc:mask="0x1" edc:name="G3FIS6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS7" edc:desc="" edc:mask="0x1" edc:name="G3FIS7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-n-" edc:cname="COG3FIS1" edc:desc="" edc:impl="0xfa" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-0-" edc:name="COG3FIS1" edc:nzwidth="8" edc:por="00000-0-" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x81A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FIS9" edc:desc="" edc:mask="0x1" edc:name="FIS9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FIS11" edc:desc="" edc:mask="0x1" edc:name="FIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS12" edc:desc="" edc:mask="0x1" edc:name="FIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS13" edc:desc="" edc:mask="0x1" edc:name="FIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS14" edc:desc="" edc:mask="0x1" edc:name="FIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FIS15" edc:desc="" edc:mask="0x1" edc:name="FIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS9" edc:desc="" edc:mask="0x1" edc:name="G3FIS9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS11" edc:desc="" edc:mask="0x1" edc:name="G3FIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS12" edc:desc="" edc:mask="0x1" edc:name="G3FIS12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS13" edc:desc="" edc:mask="0x1" edc:name="G3FIS13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS14" edc:desc="" edc:mask="0x1" edc:name="G3FIS14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FIS15" edc:desc="" edc:mask="0x1" edc:name="G3FIS15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG3FSIM0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG3FSIM0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x81B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSIM0" edc:desc="" edc:mask="0x1" edc:name="FSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM1" edc:desc="" edc:mask="0x1" edc:name="FSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM2" edc:desc="" edc:mask="0x1" edc:name="FSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM3" edc:desc="" edc:mask="0x1" edc:name="FSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM4" edc:desc="" edc:mask="0x1" edc:name="FSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM5" edc:desc="" edc:mask="0x1" edc:name="FSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM6" edc:desc="" edc:mask="0x1" edc:name="FSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM7" edc:desc="" edc:mask="0x1" edc:name="FSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3FSIM0" edc:desc="" edc:mask="0x1" edc:name="G3FSIM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM1" edc:desc="" edc:mask="0x1" edc:name="G3FSIM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM2" edc:desc="" edc:mask="0x1" edc:name="G3FSIM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM3" edc:desc="" edc:mask="0x1" edc:name="G3FSIM3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM4" edc:desc="" edc:mask="0x1" edc:name="G3FSIM4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM5" edc:desc="" edc:mask="0x1" edc:name="G3FSIM5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM6" edc:desc="" edc:mask="0x1" edc:name="G3FSIM6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM7" edc:desc="" edc:mask="0x1" edc:name="G3FSIM7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-n-" edc:cname="COG3FSIM1" edc:desc="" edc:impl="0xfa" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000-0-" edc:name="COG3FSIM1" edc:nzwidth="8" edc:por="00000-0-" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x81C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FSIM9" edc:desc="" edc:mask="0x1" edc:name="FSIM9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="FSIM11" edc:desc="" edc:mask="0x1" edc:name="FSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM12" edc:desc="" edc:mask="0x1" edc:name="FSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM13" edc:desc="" edc:mask="0x1" edc:name="FSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM14" edc:desc="" edc:mask="0x1" edc:name="FSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FSIM15" edc:desc="" edc:mask="0x1" edc:name="FSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM9" edc:desc="" edc:mask="0x1" edc:name="G3FSIM9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM11" edc:desc="" edc:mask="0x1" edc:name="G3FSIM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM12" edc:desc="" edc:mask="0x1" edc:name="G3FSIM12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM13" edc:desc="" edc:mask="0x1" edc:name="G3FSIM13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM14" edc:desc="" edc:mask="0x1" edc:name="G3FSIM14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3FSIM15" edc:desc="" edc:mask="0x1" edc:name="G3FSIM15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="COG3ASD0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0x0101--" edc:name="COG3ASD0" edc:nzwidth="8" edc:por="000101--" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x81D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ASDAC" edc:desc="" edc:mask="0x3" edc:name="ASDAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ASDBD" edc:desc="" edc:mask="0x3" edc:name="ASDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ASREN" edc:desc="" edc:mask="0x1" edc:name="ASREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASE" edc:desc="" edc:mask="0x1" edc:name="ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ASDAC0" edc:desc="" edc:mask="0x1" edc:name="ASDAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASDAC1" edc:desc="" edc:mask="0x1" edc:name="ASDAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASDBD0" edc:desc="" edc:mask="0x1" edc:name="ASDBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ASDBD1" edc:desc="" edc:mask="0x1" edc:name="ASDBD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ARSEN" edc:desc="" edc:mask="0x1" edc:name="ARSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G3ASDAC" edc:desc="" edc:mask="0x3" edc:name="G3ASDAC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G3ASDBD" edc:desc="" edc:mask="0x3" edc:name="G3ASDBD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="G3ARSEN" edc:desc="" edc:mask="0x1" edc:name="G3ARSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3ASE" edc:desc="" edc:mask="0x1" edc:name="G3ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="G3ASDAC0" edc:desc="" edc:mask="0x1" edc:name="G3ASDAC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3ASDAC1" edc:desc="" edc:mask="0x1" edc:name="G3ASDAC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3ASDBD0" edc:desc="" edc:mask="0x1" edc:name="G3ASDBD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3ASDBD1" edc:desc="" edc:mask="0x1" edc:name="G3ASDBD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3ASREN" edc:desc="" edc:mask="0x1" edc:name="G3ASREN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="COG3ASD1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="COG3ASD1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02737_pwm_cog_v2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x13" edc:_addr="0x81E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AS0E" edc:desc="" edc:mask="0x1" edc:name="AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS1E" edc:desc="" edc:mask="0x1" edc:name="AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS2E" edc:desc="" edc:mask="0x1" edc:name="AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS3E" edc:desc="" edc:mask="0x1" edc:name="AS3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS4E" edc:desc="" edc:mask="0x1" edc:name="AS4E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS5E" edc:desc="" edc:mask="0x1" edc:name="AS5E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS6E" edc:desc="" edc:mask="0x1" edc:name="AS6E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AS7E" edc:desc="" edc:mask="0x1" edc:name="AS7E" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G3AS0E" edc:desc="" edc:mask="0x1" edc:name="G3AS0E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3AS1E" edc:desc="" edc:mask="0x1" edc:name="G3AS1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3AS2E" edc:desc="" edc:mask="0x1" edc:name="G3AS2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3AS3E" edc:desc="" edc:mask="0x1" edc:name="G3AS3E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3AS4E" edc:desc="" edc:mask="0x1" edc:name="G3AS4E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3AS5E" edc:desc="" edc:mask="0x1" edc:name="G3AS5E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3AS6E" edc:desc="" edc:mask="0x1" edc:name="G3AS6E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3AS7E" edc:desc="" edc:mask="0x1" edc:name="G3AS7E" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
