garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1773.PIC
        <edc:JoinedSFRDef edc:cname="PWM11TMR" edc:desc="" edc:name="PWM11TMR" edc:nzwidth="0x10" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB9">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11TMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM11TMRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDB9">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11TMRL0" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRL0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRL1" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRL1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRL2" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRL2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRL3" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRL3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRL4" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRL4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRL5" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRL5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRL6" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRL6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRL7" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRL7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11TMRL" edc:desc="" edc:mask="0xff" edc:name="PWM11TMRL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PWM11TMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PWM11TMRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBA">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xff" edc:name="TMR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PWM11TMRH0" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRH0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRH1" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRH1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRH2" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRH2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRH3" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRH3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRH4" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRH4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRH5" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRH5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRH6" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRH6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PWM11TMRH7" edc:desc="" edc:mask="0x1" edc:name="PWM11TMRH7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PWM11TMRH" edc:desc="" edc:mask="0xff" edc:name="PWM11TMRH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnn--" edc:cname="PWM11CON" edc:desc="" edc:impl="0xbc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000--" edc:name="PWM11CON" edc:nzwidth="8" edc:por="0-0000--" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xDBB">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM11MODE0" edc:desc="" edc:mask="0x1" edc:name="PWM11MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11MODE1" edc:desc="" edc:mask="0x1" edc:name="PWM11MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM11MODE" edc:desc="" edc:mask="0x3" edc:name="PWM11MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PWM11POL" edc:desc="" edc:mask="0x1" edc:name="PWM11POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM11OUT" edc:desc="" edc:mask="0x1" edc:name="PWM11OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM11EN" edc:desc="" edc:mask="0x1" edc:name="PWM11EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
