garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1773.PIC
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CLC3CON" edc:desc="Configurable logic cell control" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CLC3CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF24">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3MODE" edc:desc="" edc:mask="0x7" edc:name="LC3MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="LC3INTN" edc:desc="" edc:mask="0x1" edc:name="LC3INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3INTP" edc:desc="" edc:mask="0x1" edc:name="LC3INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3OUT" edc:desc="" edc:mask="0x1" edc:name="LC3OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LC3EN" edc:desc="" edc:mask="0x1" edc:name="LC3EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3MODE0" edc:desc="" edc:mask="0x1" edc:name="LC3MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3MODE1" edc:desc="" edc:mask="0x1" edc:name="LC3MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3MODE2" edc:desc="" edc:mask="0x1" edc:name="LC3MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n---nnnn" edc:cname="CLC3POL" edc:desc="Polarity control" edc:impl="0x8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---uuuu" edc:name="CLC3POL" edc:nzwidth="8" edc:por="0---xxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF25">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3G1POL" edc:desc="" edc:mask="0x1" edc:name="LC3G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G2POL" edc:desc="" edc:mask="0x1" edc:name="LC3G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G3POL" edc:desc="" edc:mask="0x1" edc:name="LC3G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4POL" edc:desc="" edc:mask="0x1" edc:name="LC3G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LC3POL" edc:desc="" edc:mask="0x1" edc:name="LC3POL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="G1POL" edc:desc="" edc:mask="0x1" edc:name="G1POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G2POL" edc:desc="" edc:mask="0x1" edc:name="G2POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G3POL" edc:desc="" edc:mask="0x1" edc:name="G3POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4POL" edc:desc="" edc:mask="0x1" edc:name="G4POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLC3SEL0" edc:desc="Input select register 1" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLC3SEL0" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF26">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3D1S0" edc:desc="" edc:mask="0x1" edc:name="LC3D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D1S1" edc:desc="" edc:mask="0x1" edc:name="LC3D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D1S2" edc:desc="" edc:mask="0x1" edc:name="LC3D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D1S3" edc:desc="" edc:mask="0x1" edc:name="LC3D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D1S4" edc:desc="" edc:mask="0x1" edc:name="LC3D1S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D1S5" edc:desc="" edc:mask="0x1" edc:name="LC3D1S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3D1S" edc:desc="" edc:mask="0x3f" edc:name="LC3D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D1S" edc:desc="" edc:mask="0x3f" edc:name="D1S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D1S0" edc:desc="" edc:mask="0x1" edc:name="D1S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S1" edc:desc="" edc:mask="0x1" edc:name="D1S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S2" edc:desc="" edc:mask="0x1" edc:name="D1S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S3" edc:desc="" edc:mask="0x1" edc:name="D1S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S4" edc:desc="" edc:mask="0x1" edc:name="D1S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D1S5" edc:desc="" edc:mask="0x1" edc:name="D1S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLC3SEL1" edc:desc="Input select register 1" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLC3SEL1" edc:nzwidth="8" edc:por="--xxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF27">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC3D2S0" edc:desc="" edc:mask="0x1" edc:name="LC3D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D2S1" edc:desc="" edc:mask="0x1" edc:name="LC3D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D2S2" edc:desc="" edc:mask="0x1" edc:name="LC3D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D2S3" edc:desc="" edc:mask="0x1" edc:name="LC3D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D2S4" edc:desc="" edc:mask="0x1" edc:name="LC3D2S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3D2S5" edc:desc="" edc:mask="0x1" edc:name="LC3D2S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3D2S" edc:desc="" edc:mask="0x3f" edc:name="LC3D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="D2S" edc:desc="" edc:mask="0x3f" edc:name="D2S" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="D2S0" edc:desc="" edc:mask="0x1" edc:name="D2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S1" edc:desc="" edc:mask="0x1" edc:name="D2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S2" edc:desc="" edc:mask="0x1" edc:name="D2S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S3" edc:desc="" edc:mask="0x1" edc:name="D2S3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S4" edc:desc="" edc:mask="0x1" edc:name="D2S4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D2S5" edc:desc="" edc:mask="0x1" edc:name="D2S5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
