garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1773.PIC
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="INT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A B">
      <edc:VirtualPin edc:name="T0CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T1CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T1G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T3CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T3G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T5CKI"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T5G"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="T2IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T4IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T6IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="T8IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="MD1CL"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="MD1CH"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="MD1MOD"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="MD2CL"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="MD2CH"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="MD2MOD"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="MD3CL"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="MD3CH"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="MD3MOD"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PRG1R"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PRG1F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PRG2R"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PRG2F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="PRG3R"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="PRG3F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN0"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLCIN1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CLCIN2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CLCIN3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="ADCACT"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="A C">
      <edc:VirtualPin edc:name="SS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="MD3OUT" edc:ppsval="0x30"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="MD2OUT" edc:ppsval="0x2F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="MD1OUT" edc:ppsval="0x2E"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="C6OUT" edc:ppsval="0x2B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="C5OUT" edc:ppsval="0x2A"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="C4OUT" edc:ppsval="0x29"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="C3OUT" edc:ppsval="0x28"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsval="0x27"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsval="0x26"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="DT" edc:ppsval="0x25"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="TX" edc:ppsval="0x24"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CK" edc:ppsval="0x24"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDO" edc:ppsval="0x23"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDA" edc:ppsval="0x22"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCK" edc:ppsval="0x21"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="bi" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SCL" edc:ppsval="0x21"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="PWM11OUT" edc:ppsval="0x1F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PWM6OUT" edc:ppsval="0x1E"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PWM5OUT" edc:ppsval="0x1D"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PWM9OUT" edc:ppsval="0x1B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PWM4OUT" edc:ppsval="0x1A"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="PWM3OUT" edc:ppsval="0x19"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP7" edc:ppsval="0x17"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CCP2" edc:ppsval="0x16"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CCP1" edc:ppsval="0x15"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="COG3D" edc:ppsval="0x10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="COG3C" edc:ppsval="0x0F"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="COG3B" edc:ppsval="0x0E"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="COG3A" edc:ppsval="0x0D"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG2D" edc:ppsval="0x0C"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG2C" edc:ppsval="0x0B"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG2B" edc:ppsval="0x0A"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG2A" edc:ppsval="0x09"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1D" edc:ppsval="0x08"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1C" edc:ppsval="0x07"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1B" edc:ppsval="0x06"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="COG1A" edc:ppsval="0x05"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CLC4OUT" edc:ppsval="0x04"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="B C">
      <edc:VirtualPin edc:name="CLC3OUT" edc:ppsval="0x03"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC2OUT" edc:ppsval="0x02"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out" edc:ppsports="A C">
      <edc:VirtualPin edc:name="CLC1OUT" edc:ppsval="0x01"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in" edc:ppsports="B C">
      <edc:VirtualPin edc:name="SDI"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>
